Revit 2027 API
LinkLoadResult.IsCodeSuccess Method
 Check if load result code signifies success.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCodeSuccess(
	LinkLoadResultType code
)
Public Shared Function IsCodeSuccess (
	code As LinkLoadResultType
) As Boolean
public:
static bool IsCodeSuccess(
	LinkLoadResultType code
)
static member IsCodeSuccess :
        code : LinkLoadResultType -> bool
Parameters
code LinkLoadResultType
 Load result code to be verified.
Return Value
Boolean
 True if LinkLoadResultType argument is success, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace